// 1.定义状态容器和状态
// 2.修改容器中的state
// 3.仓库中的actions的使用
import { defineStore } from 'pinia'
import { userStore } from './user'

export const mainStore = defineStore('main', {
  state: () => { 
    // 定义状态
    return {
      device1Pos:[116.326755, 39.788338],// 有人机 实时位置
      device1Line: [],// 有人机 航线
      device2Pos:[116.316062, 39.828417], // 无人机 实时位置
      device2Line: [], // 无人机 航线
      altitude: 0, // 有人机 高度
      headingAngle: 0, // 有人机偏转角度
      scene: 2,// 场景1 单个飞机  场景2 有人机和无人机 
      barrierPos: [116.316818358, 39.828504248],// 障碍物坐标
      barrierStyle: [50, 1600, 300],// 障碍物形状
      airportList: [
        {
          name: '北京市门头沟区综应急救援队',//机场名称 
          position: [116.118815,39.922553],//机场位置
        },
        {
          name: '鲁家山循环(静脉产业)基地',//机场名称 
          position: [116.054996,39.85431],//机场位置
        },
        {
          name: '王坡村委会',//机场名称 
          position: [116.026354,39.907375],//机场位置
        },
        {
          name: '花鸟市场',//机场名称 
          position: [115.998503,39.853098],//机场位置
        },
        {
          name: '草甸水客运站',//机场名称 
          position: [116.004875,39.898579],//机场位置
        },
      
      ],
      // 帮我写一个变量 用来存放无人机的位置
      
      // 无人机场站
      area: [], // 存储区域
      areaSave:[],//对象存储地址
      centerPoint: [],
      fireRange:[ [ { "Q": 39.88405250992457, "R": 115.98691757038239, "lng": 115.986918, "lat": 39.884053 }, { "Q": 39.87529472119752, "R": 115.97959284245974, "lng": 115.979593, "lat": 39.875295 }, { "Q": 39.86823551688767, "R": 115.99365133792162, "lng": 115.993651, "lat": 39.868236 }, { "Q": 39.869374945943, "R": 116.01888090133667, "lng": 116.018881, "lat": 39.869375 }, { "Q": 39.87835377629659, "R": 116.0065115042031, "lng": 116.006512, "lat": 39.878354 } ] ]
    }
  },
  getters: {
  }, // 监测状态 相当于 computed 计算属性
  actions: {
  } // 操作 相当于 methods 
})